## **Задача:**

*Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше или равна 3 символам. Первоначальный массив можно ввести с клавиатуры.*

## **Решение:**
Программу мы начинаем с запроса получения данных от пользователя

    количество элементов n
    массив arr для наполнения пользовательскими строками
    string[] arr = new string[n]

Для решения задачи используется массив строк **"arr"**, длину которого **"n"** задал пользователь. Данные мы получаем с помощью цикла *"for"*, запрашивая у пользователя значение каждой отдельной строки массива.

    for (int i = 0; i < n; i++)
    {
        Console.Write($"Введите строку {i + 1}: ");
        arr[i] = Console.ReadLine();
    }

Далее создаем новый массив **"result"**, который будет содержать только те строки из **"arr"**, длина которых меньше или равна 3 символам.

Для этого мы проходим по каждому элементу массива **"arr"** и проверяем его длину. 

    for (int i = 0; i < n; i++)
    {
        string s = arr[i];
        ...
    }
Если длина строки меньше или равна 3, то мы добавляем эту строку в массив **"result"**. 

    if (s.Length <= 3)
    {
        result[index++] = s;
    }
Мы используем переменную **"index"**, чтобы отслеживать индекс следующего элемента, который нужно добавить в массив **"result"**.

После того как мы прошлись по всем элементам массива **"arr"**, мы выводим все строки из массива **"result"**

    Console.WriteLine("Строки, длина которых меньше или равна 3:");

Для этого используется цикл *"for"* и переменную **"index"**.

    for (int i = 0; i < index; i++)
    {
        Console.WriteLine(result[i]);
    }